Reports/ИнвентарнаяКнигаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ИнвентарнаяКнигаОС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/СобытияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СобытияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который отражает события, происходящие с ОС в организациях. Данные вносятся только документами. По этому регистру ведется анализ даты модернизации, перемещения и проч.</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатратБУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИспользованияДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаДооценокОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратТекущегоМесяца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ИнвентарнаяКнигаОС/Ext/ObjectModule.bsl
#Если Клиент Тогда

// Процедура формирует табличный документ с обложкой инвентарной книги.
//
// Параметры:
//  ДокументРезультат - табличный документ, в который выводится
//                      обложка инвентарной книги.
//
// Возвращаемое значение:
//  Нет.
//
Процедура СформироватьОбложкуИнвентарнойКнигиОС(ДокументРезультат) Экспорт
	
	ДатаОтбора = ?(ЗначениеЗаполнено(КонецПериода), КонецПериода, Неопределено);
	
	Сведения             = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, ДатаОтбора);
	ДанныеОтветственного = ОбщегоНазначения.ДанныеФизЛица(Организация, Ответственный, ДатаОтбора);
	
	ДокументРезультат.Очистить();
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСверху         = 20;
	ДокументРезультат.ПолеСнизу          = 20;
	ДокументРезультат.ПолеСлева          = 10;
	ДокументРезультат.ПолеСправа         = 10;
	
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентарнаяКнигаОС_Обложка";
	
	Макет = ПолучитьМакет("Обложка");
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	Макет.Параметры.НаименованиеОрганизации          = Сведения.ПолноеНаименование;
	Макет.Параметры.ОКПО                             = УправлениеКонтактнойИнформацией.ПолучитьКодОрганизации(Сведения);
	Макет.Параметры.Период                           = " с " + ?(НЕ ЗначениеЗаполнено(НачалоПериода), """____"" ___________ ______ г.", Формат(НачалоПериода, "ДЛФ=DD"+";Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса()))) + " по " + ?(НЕ ЗначениеЗаполнено(КонецПериода), """____"" ___________ ______ г.", Формат(КонецПериода, "ДЛФ=DD"+";Л="+Локализация.ОпределитьКодЯзыкаДляФормат(Локализация.КодЯзыкаИнтерфейса())));
	Макет.Параметры.НаименованиеПодразделения        = ?(ЗначениеЗаполнено(Подразделение), Подразделение.Наименование, "");  
	Макет.Параметры.КодПодразделения                 = ?(ЗначениеЗаполнено(Подразделение), Подразделение.Код, "");
	Макет.Параметры.Должность                        = ДанныеОтветственного.Должность;
	Макет.Параметры.ФамилияИО                        = ДанныеОтветственного.Представление;
	Макет.Параметры.ТабельныйНомер                   = ДанныеОтветственного.ТабельныйНомер;
	
	ДокументРезультат.Вывести(Макет);

	ДокументРезультат.ТолькоПросмотр = Истина;
	
КонецПроцедуры // СформироватьОбложку()

// Процедура формирует табличный документ со страницами инвентарной книги.
//
// Параметры:
//  ДокументРезультат - табличный документ, в который выводятся
//                      страницы инвентарной книги.
//
// Возвращаемое значение:
//  Нет.
//
Процедура СформироватьСтраницыИнвентарнойКнигиОС(ДокументРезультат) Экспорт
	
	Запрос = Новый Запрос();
	
	СубконтоОС = Новый Массив();
	СубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	
	Запрос.УстановитьПараметр("СубконтоОС",    СубконтоОС);
	Запрос.УстановитьПараметр("НачалоПериода", ?(НЕ ЗначениеЗаполнено(НачалоПериода), НачалоПериода, НачалоДня(НачалоПериода)));
	Запрос.УстановитьПараметр("КонецПериода",  ?(НЕ ЗначениеЗаполнено(КонецПериода), КонецПериода, КонецДня(КонецПериода)));
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("Состояние",     Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);	
	Запрос.УстановитьПараметр("МОЛ",           МОЛ);
	Запрос.УстановитьПараметр("СобытияИсключения", Перечисления.ВидыСобытийОС.Модернизация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ Разрешенные
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ОсновноеСредство.НаименованиеПолное КАК ОсновноеСредствоНаименованиеПолное,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ОсновноеСредство.Наименование КАК ОсновноеСредствоНаименование,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ОсновноеСредство КАК ОсновноеСредствоСсылка,
	|	ПРЕДСТАВЛЕНИЕ(СрезПоследнихПоРегистрамСведенийИБухгалтерии.Документ) КАК ПредставлениеДокумента,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.Документ,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ТипДокумента,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ДатаДокумента КАК ДатаДокумента,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПричинаСписания,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.СрокПолезногоИспользования,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ИнвентарныйНомер,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПервоначальнаяСтоимость,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПоследнееМОЛ,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПоследнееМОЛ.Представление,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПредпоследнееМОЛ,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПредпоследнееМОЛ.Представление,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПоследнееМестонахождение,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПоследнееМестонахождение.Представление,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПредпоследнееМестонахождение,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПредпоследнееМестонахождение.Представление,
	|	СостоянияОСОрганизаций.ДатаСостояния КАК ДатаПринятияКУчету,
	|	СостоянияОСОрганизаций.Регистратор КАК ДокументПринятияКУчету,
	|	ВосстановительнаяСтоимостьОСБУ.СуммаКонечныйОстатокДт КАК ВосстановительнаяСтоимость,
	|	НачисленнаяАмортизацияИлиИзносОСБУ.СуммаКонечныйОстатокКт КАК НачисленнаяАмортизация,
	|	НачисленнаяАмортизацияИлиИзносОСБУ.СуммаКонечныйОстатокДт КАК НачисленныйИзнос,
	|	АмортизацияИлиИзносПоДокументу.СуммаОборотКт КАК АмортизацияПоДокументу,
	|	АмортизацияИлиИзносПоДокументу.СуммаОборотДт КАК ИзносПоДокументу,
	|	СрезПоследнихПоРегистрамСведенийИБухгалтерии.СчетНачисленияАмортизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		СрезПоследнихПоРегистрамСведений.ОсновноеСредство КАК ОсновноеСредство,
	|		СрезПоследнихПоРегистрамСведений.Документ КАК Документ,
	|		СрезПоследнихПоРегистрамСведений.ТипДокумента КАК ТипДокумента,
	|		СрезПоследнихПоРегистрамСведений.ДатаДокумента КАК ДатаДокумента,
	|		СрезПоследнихПоРегистрамСведений.ДатаДвиженийБухгалтерии КАК ДатаДвиженийБухгалтерии,
	|		СрезПоследнихПоРегистрамСведений.ПричинаСписания КАК ПричинаСписания,
	|		СрезПоследнихПоРегистрамСведений.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|		СрезПоследнихПоРегистрамСведений.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|		СрезПоследнихПоРегистрамСведений.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|		СрезПоследнихПоРегистрамСведений.ПоследнееМОЛ КАК ПоследнееМОЛ,
	|		СрезПоследнихПоРегистрамСведений.ПредпоследнееМОЛ КАК ПредпоследнееМОЛ,
	|		СрезПоследнихПоРегистрамСведений.ПоследнееМестонахождение КАК ПоследнееМестонахождение,
	|		СрезПоследнихПоРегистрамСведений.ПредпоследнееМестонахождение КАК ПредпоследнееМестонахождение,
	|		МАКСИМУМ(ВосстановительнаяСтоимостьОСБУ.Период) КАК ДатаПоследнегоДвиженияВосстановительнаяСтоимость,
	|		МАКСИМУМ(НачисленнаяАмортизацияИлиИзносОСБУ.Период) КАК ДатаПоследнегоДвиженияНачисленнаяАмортизацияИлиИзнос,
	|		СрезПоследнихПоРегистрамСведений.СчетУчета КАК СчетУчета,
	|		СрезПоследнихПоРегистрамСведений.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДатыПоследнихДвиженийПоРегистрамСведений.ОсновноеСредство КАК ОсновноеСредство,
	|			ДатыПоследнихДвиженийПоРегистрамСведений.Документ КАК Документ,
	|			ДатыПоследнихДвиженийПоРегистрамСведений.ТипДокумента КАК ТипДокумента,
	|			ДатыПоследнихДвиженийПоРегистрамСведений.ДатаДокумента КАК ДатаДокумента,
	|			ДатыПоследнихДвиженийПоРегистрамСведений.ДатаДвиженийБухгалтерии КАК ДатаДвиженийБухгалтерии,
	|			ДатыПоследнихДвиженийПоРегистрамСведений.ПричинаСписания КАК ПричинаСписания,
	|			ПараметрыАмортизацииОСБухгалтерскийУчет.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|			ПервоначальныеСведенияОСБухгалтерскийУчет.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|			ПервоначальныеСведенияОСБухгалтерскийУчет.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|			СчетаБухгалтерскогоУчетаОС.СчетУчета КАК СчетУчета,
	|			СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации КАК СчетНачисленияАмортизации,
	|			МестонахождениеОСБухгалтерскийУчетПоследнее.МОЛ КАК ПоследнееМОЛ,
	|			МестонахождениеОСБухгалтерскийУчетПоследнее.Местонахождение КАК ПоследнееМестонахождение,
	|			МестонахождениеОСБухгалтерскийУчетПредпоследнее.МОЛ КАК ПредпоследнееМОЛ,
	|			МестонахождениеОСБухгалтерскийУчетПредпоследнее.Местонахождение КАК ПредпоследнееМестонахождение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ДвиженияОС.ОсновноеСредство КАК ОсновноеСредство,
	|				ДвиженияОС.Документ КАК Документ,
	|				ДвиженияОС.ТипДокумента КАК ТипДОкумента,
	|				ДвиженияОС.ДатаДокумента КАК ДатаДокумента,
	|				ДвиженияОС.ДатаДвиженийБухгалтерии КАК ДатаДвиженийБухгалтерии,
	|				ДвиженияОС.ПричинаСписания КАК ПричинаСписания,
	|				МАКСИМУМ(ПервоначальныеСведенияОСБухгалтерскийУчет.Период) КАК ДатаПоследнегоПервоначальныеСведенияОС,
	|				МАКСИМУМ(ПараметрыАмортизацииОСБухгалтерскийУчет.Период) КАК ДатаПоследнегоПараметрыАмортизацииОС,
	|				МАКСИМУМ(МестонахождениеОСБухгалтерскийУчетПоследнее.Период) КАК ДатаПоследнегоМестонахождениеОС,
	|				МАКСИМУМ(МестонахождениеОСБухгалтерскийУчетПредпоследнее.Период) КАК ДатаПредпоследнегоМестонахождениеОС,
	|				МАКСИМУМ(СчетаБухгалтерскогоУчетаОС.Период) КАК ДатаПоследнегоСчетаБухгалтерскогоУчетаОС
	|			ИЗ
	|				(ВЫБРАТЬ
	|					СобытияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство,
	|					Документы.Ссылка КАК Документ,
	|					Документы.ТипДокумента КАК ТипДокумента,
	|					Документы.ПричинаСписания КАК ПричинаСписания,
	|					СобытияОСОрганизаций.Период КАК ДатаДокумента,
	|					Документы.ДатаДвиженийБухгалтерии КАК ДатаДвиженийБухгалтерии
	|				ИЗ
	|					РегистрСведений.СобытияОСОрганизаций КАК СобытияОСОрганизаций
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|							ВводВЭксплуатациюОС.Ссылка КАК Ссылка,
	|							ВводВЭксплуатациюОС.Дата КАК ДатаДвиженийБухгалтерии,
	|							""ВводВЭксплуатациюОС"" КАК ТипДокумента,
	|							"""" КАК ПричинаСписания
	|						ИЗ
	|							Документ.ВводВЭксплуатациюОС КАК ВводВЭксплуатациюОС
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ВводНачальныхОстатковОС.Ссылка,
	|							ВводНачальныхОстатковОС.Дата,
	|							""ВводВЭксплуатациюОС"",
	|							""""
	|						ИЗ
	|							Документ.ВводНачальныхОстатковОС КАК ВводНачальныхОстатковОС
	|
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ПеремещениеОС.Ссылка,
	|							ПеремещениеОС.Дата,
	|							""ПеремещениеОС"",
	|							""""
	|						ИЗ
	|							Документ.ПеремещениеОС КАК ПеремещениеОС
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ПередачаОС.Ссылка,
	|							ПодготовкаКПередачеОС.Дата,
	|							""ПередачаОС"",
	|							""""
	|						ИЗ
	|							Документ.ПередачаОС КАК ПередачаОС
	|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодготовкаКПередачеОС КАК ПодготовкаКПередачеОС
	|								ПО ПередачаОС.ДокПодготовкаКПередачеОС = ПодготовкаКПередачеОС.Ссылка
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							ПередачаОС.Ссылка,
	|							ПередачаОС.Дата,
	|							""ПередачаОС"",
	|							""""
	|						ИЗ
	|							Документ.ПередачаОС КАК ПередачаОС
	|								ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПодготовкаКПередачеОС КАК ПодготовкаКПередачеОС
	|								ПО ПередачаОС.ДокПодготовкаКПередачеОС <> ПодготовкаКПередачеОС.Ссылка
	|						
	|						ОБЪЕДИНИТЬ ВСЕ
	|						
	|						ВЫБРАТЬ
	|							СписаниеОС.Ссылка,
	|							СписаниеОС.Дата,
	|							""СписаниеОС"",
	|							СписаниеОС.ПричинаСписания.Представление
	|						ИЗ
	|							Документ.СписаниеОС КАК СписаниеОС) КАК Документы
	|						ПО СобытияОСОрганизаций.Регистратор = Документы.Ссылка
	|				
	|				ГДЕ
	|" + ?(НЕ ЗначениеЗаполнено(НачалоПериода) И НЕ ЗначениеЗаполнено(КонецПериода), "", "СобытияОСОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода И") + "				   
	|					СобытияОСОрганизаций.Организация = &Организация
	|                   И НЕ (СобытияОСОрганизаций.Событие.ВидСобытияОС В (&СобытияИсключения))
	|					) КАК ДвиженияОС
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|					ПО ДвиженияОС.ДатаДокумента >= ПервоначальныеСведенияОСБухгалтерскийУчет.Период И ДвиженияОС.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчетПоследнее
	|					ПО ДвиженияОС.ДатаДвиженийБухгалтерии >= МестонахождениеОСБухгалтерскийУчетПоследнее.Период И ДвиженияОС.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетПоследнее.ОсновноеСредство И (МестонахождениеОСБухгалтерскийУчетПоследнее.Организация = &Организация)
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	|					ПО ДвиженияОС.ДатаДвиженийБухгалтерии >= ПараметрыАмортизацииОСБухгалтерскийУчет.Период И ДвиженияОС.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчетПредпоследнее
	|					ПО ДвиженияОС.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетПредпоследнее.ОсновноеСредство И ДвиженияОС.ДатаДокумента > МестонахождениеОСБухгалтерскийУчетПредпоследнее.Период И (МестонахождениеОСБухгалтерскийУчетПредпоследнее.Организация = &Организация)
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|					ПО ДвиженияОС.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство И ДвиженияОС.ДатаДвиженийБухгалтерии >= СчетаБухгалтерскогоУчетаОС.Период И (СчетаБухгалтерскогоУчетаОС.Организация = &Организация)
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДвиженияОС.ОсновноеСредство,
	|				ДвиженияОС.Документ,
	|				ДвиженияОС.ТипДокумента,
	|				ДвиженияОС.ДатаДокумента,
	|				ДвиженияОС.ДатаДвиженийБухгалтерии,
	|				ДвиженияОС.ПричинаСписания) КАК ДатыПоследнихДвиженийПоРегистрамСведений
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|				ПО ДатыПоследнихДвиженийПоРегистрамСведений.ОсновноеСредство = СчетаБухгалтерскогоУчетаОС.ОсновноеСредство И ДатыПоследнихДвиженийПоРегистрамСведений.ДатаПоследнегоСчетаБухгалтерскогоУчетаОС = СчетаБухгалтерскогоУчетаОС.Период И (СчетаБухгалтерскогоУчетаОС.Организация = &Организация)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчетПоследнее
	|				ПО ДатыПоследнихДвиженийПоРегистрамСведений.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетПоследнее.ОсновноеСредство И ДатыПоследнихДвиженийПоРегистрамСведений.ДатаПоследнегоМестонахождениеОС = МестонахождениеОСБухгалтерскийУчетПоследнее.Период И (МестонахождениеОСБухгалтерскийУчетПоследнее.Организация = &Организация)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчетПредпоследнее
	|				ПО ДатыПоследнихДвиженийПоРегистрамСведений.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетПредпоследнее.ОсновноеСредство И ДатыПоследнихДвиженийПоРегистрамСведений.ДатаПредпоследнегоМестонахождениеОС = МестонахождениеОСБухгалтерскийУчетПредпоследнее.Период И (МестонахождениеОСБухгалтерскийУчетПредпоследнее.Организация = &Организация)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	|				ПО ДатыПоследнихДвиженийПоРегистрамСведений.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство И ДатыПоследнихДвиженийПоРегистрамСведений.ДатаПоследнегоПараметрыАмортизацииОС = ПараметрыАмортизацииОСБухгалтерскийУчет.Период И (ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация)
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|				ПО ДатыПоследнихДвиженийПоРегистрамСведений.ОсновноеСредство = ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство И ДатыПоследнихДвиженийПоРегистрамСведений.ДатаПоследнегоПервоначальныеСведенияОС = ПервоначальныеСведенияОСБухгалтерскийУчет.Период) КАК СрезПоследнихПоРегистрамСведений
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Запись, , , &СубконтоОС, Организация = &Организация) КАК ВосстановительнаяСтоимостьОСБУ
	|			ПО СрезПоследнихПоРегистрамСведений.ОсновноеСредство = ВосстановительнаяСтоимостьОСБУ.Субконто1 И СрезПоследнихПоРегистрамСведений.СчетУчета = ВосстановительнаяСтоимостьОСБУ.Счет И СрезПоследнихПоРегистрамСведений.ДатаДвиженийБухгалтерии > ВосстановительнаяСтоимостьОСБУ.Период
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Запись, , , &СубконтоОС, Организация = &Организация) КАК НачисленнаяАмортизацияИлиИзносОСБУ
	|			ПО СрезПоследнихПоРегистрамСведений.ОсновноеСредство = НачисленнаяАмортизацияИлиИзносОСБУ.Субконто1 И СрезПоследнихПоРегистрамСведений.СчетНачисленияАмортизации = НачисленнаяАмортизацияИлиИзносОСБУ.Счет И СрезПоследнихПоРегистрамСведений.ДатаДвиженийБухгалтерии > НачисленнаяАмортизацияИлиИзносОСБУ.Период
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СрезПоследнихПоРегистрамСведений.ОсновноеСредство,
	|				СрезПоследнихПоРегистрамСведений.Документ,
	|				СрезПоследнихПоРегистрамСведений.ТипДокумента,
	|				СрезПоследнихПоРегистрамСведений.ДатаДокумента,
	|				СрезПоследнихПоРегистрамСведений.ПричинаСписания,
	|				СрезПоследнихПоРегистрамСведений.СрокПолезногоИспользования,
	|				СрезПоследнихПоРегистрамСведений.ИнвентарныйНомер,
	|				СрезПоследнихПоРегистрамСведений.ПервоначальнаяСтоимость,
	|				СрезПоследнихПоРегистрамСведений.ПоследнееМОЛ,
	|				СрезПоследнихПоРегистрамСведений.ПредпоследнееМОЛ,
	|				СрезПоследнихПоРегистрамСведений.ПоследнееМестонахождение,
	|				СрезПоследнихПоРегистрамСведений.ПредпоследнееМестонахождение,
	|				СрезПоследнихПоРегистрамСведений.СчетУчета,
	|				СрезПоследнихПоРегистрамСведений.СчетНачисленияАмортизации,
	|				СрезПоследнихПоРегистрамСведений.ДатаДвиженийБухгалтерии) КАК СрезПоследнихПоРегистрамСведенийИБухгалтерии
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , , &СубконтоОС, Организация = &Организация) КАК ВосстановительнаяСтоимостьОСБУ
	|		ПО СрезПоследнихПоРегистрамСведенийИБухгалтерии.ДатаПоследнегоДвиженияВосстановительнаяСтоимость = ВосстановительнаяСтоимостьОСБУ.Период И СрезПоследнихПоРегистрамСведенийИБухгалтерии.ОсновноеСредство = ВосстановительнаяСтоимостьОСБУ.Субконто1 И СрезПоследнихПоРегистрамСведенийИБухгалтерии.СчетУчета = ВосстановительнаяСтоимостьОСБУ.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , , &СубконтоОС, Организация = &Организация) КАК НачисленнаяАмортизацияИлиИзносОСБУ
	|		ПО СрезПоследнихПоРегистрамСведенийИБухгалтерии.ДатаПоследнегоДвиженияНачисленнаяАмортизацияИлиИзнос = НачисленнаяАмортизацияИлиИзносОСБУ.Период И СрезПоследнихПоРегистрамСведенийИБухгалтерии.ОсновноеСредство = НачисленнаяАмортизацияИлиИзносОСБУ.Субконто1 И СрезПоследнихПоРегистрамСведенийИБухгалтерии.СчетНачисленияАмортизации = НачисленнаяАмортизацияИлиИзносОСБУ.Счет
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	|		ПО СрезПоследнихПоРегистрамСведенийИБухгалтерии.ОсновноеСредство = СостоянияОСОрганизаций.ОсновноеСредство И (СостоянияОСОрганизаций.Организация = &Организация) И (СостоянияОСОрганизаций.Состояние = &Состояние)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, , ,&СубконтоОС , Организация = &Организация) КАК АмортизацияИлиИзносПоДокументу
	|		ПО СрезПоследнихПоРегистрамСведенийИБухгалтерии.ОсновноеСредство = АмортизацияИлиИзносПоДокументу.Субконто1 И СрезПоследнихПоРегистрамСведенийИБухгалтерии.ДатаДвиженийБухгалтерии = АмортизацияИлиИзносПоДокументу.Период И СрезПоследнихПоРегистрамСведенийИБухгалтерии.СчетНачисленияАмортизации = АмортизацияИлиИзносПоДокументу.Счет
	|
	|" + ?((ЗначениеЗаполнено(Подразделение)) ИЛИ (ЗначениеЗаполнено(МОЛ)), "ГДЕ " ,"") + ?(НЕ ЗначениеЗаполнено(Подразделение), "", "СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПоследнееМестонахождение = &Подразделение") + 
				   ?(НЕ ЗначениеЗаполнено(МОЛ), "", ?(НЕ ЗначениеЗаполнено(Подразделение), "", " И ") + "СрезПоследнихПоРегистрамСведенийИБухгалтерии.ПоследнееМОЛ = &МОЛ") + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента
	|";

	Выборка = Запрос.Выполнить().Выбрать();
	
	// Заполнение таблицы строк инвентарной книги.
	
	СтрокиИнвентарнойКниги = Новый ТаблицаЗначений();
	СтрокиИнвентарнойКниги.Колонки.Добавить("ДокументСсылка");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ОсновноеСредствоСсылка");	
	СтрокиИнвентарнойКниги.Колонки.Добавить("ОсновноеСредство");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ИнвентарныйНомер");
	СтрокиИнвентарнойКниги.Колонки.Добавить("СрокПолезногоИспользования");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПервоначальнаяСтоимость");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПоступилоПредставлениеДокумента");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПоступилоДатаПринятияКУчету");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПоступилоДокументПринятияКУчету");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПоступилоПодразделение");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПоступилоМОЛ");
	СтрокиИнвентарнойКниги.Колонки.Добавить("НачисленнаяАмортизацияИлиИзнос");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ОстаточнаяСтоимость");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПеремещениеИлиВыбытиеПредставлениеДокумента");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПеремещениеИлиВыбытиеПодразделение");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПеремещениеИлиВыбытиеМОЛ");
	СтрокиИнвентарнойКниги.Колонки.Добавить("ПеремещениеИлиВыбытиеПричинаВыбытия");
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаИнвентарнойКниги = СтрокиИнвентарнойКниги.Добавить();
		
		СтрокаИнвентарнойКниги.ОсновноеСредствоСсылка                          = Выборка.ОсновноеСредствоСсылка;
		СтрокаИнвентарнойКниги.ОсновноеСредство                                = ?(НЕ ЗначениеЗаполнено(Выборка.ОсновноеСредствоНаименованиеПолное), Выборка.ОсновноеСредствоНаименование, Выборка.ОсновноеСредствоНаименованиеПолное);
		СтрокаИнвентарнойКниги.ИнвентарныйНомер                                = Выборка.ИнвентарныйНомер;
		СтрокаИнвентарнойКниги.СрокПолезногоИспользования                      = Выборка.СрокПолезногоИспользования;
		СтрокаИнвентарнойКниги.ДокументСсылка                                  = Выборка.Документ;
		
		Если Выборка.ТипДокумента = "ВводВЭксплуатациюОС" Тогда
			
			// Четная страница.
			СтрокаИнвентарнойКниги.ПоступилоПредставлениеДокумента             = Выборка.ПредставлениеДокумента;
			СтрокаИнвентарнойКниги.ПоступилоДатаПринятияКУчету                 = Выборка.ДатаПринятияКУчету;
			СтрокаИнвентарнойКниги.ПоступилоДокументПринятияКУчету             = Выборка.ДокументПринятияКУчету;
			СтрокаИнвентарнойКниги.ПоступилоПодразделение                      = Выборка.ПоследнееМестонахождениеПредставление;
			СтрокаИнвентарнойКниги.ПоступилоМОЛ                                = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.ПоследнееМОЛПредставление);
			СтрокаИнвентарнойКниги.ПервоначальнаяСтоимость                     = Выборка.ПервоначальнаяСтоимость;
			СтрокаИнвентарнойКниги.НачисленнаяАмортизацияИлиИзнос              = 0;
			
			// Нечетная страница.
			СтрокаИнвентарнойКниги.ОстаточнаяСтоимость                         = Выборка.ПервоначальнаяСтоимость;
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПредставлениеДокумента = "";
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПодразделение          = "";
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеМОЛ                    = "";
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПричинаВыбытия         = "";
			
		ИначеЕсли Выборка.ТипДокумента = "ПеремещениеОС" И Выборка.ПоследнееМестонахождение = Подразделение Тогда
			
			// Четная страница.
			СтрокаИнвентарнойКниги.ПоступилоПредставлениеДокумента             = Выборка.ПредставлениеДокумента;
			СтрокаИнвентарнойКниги.ПоступилоДатаПринятияКУчету                 = Выборка.ДатаПринятияКУчету;
			СтрокаИнвентарнойКниги.ПоступилоДокументПринятияКУчету             = "";
			СтрокаИнвентарнойКниги.ПоступилоПодразделение                      = Выборка.ПоследнееМестонахождениеПредставление;
			СтрокаИнвентарнойКниги.ПоступилоМОЛ                                = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.ПоследнееМОЛПредставление);
			СтрокаИнвентарнойКниги.ПервоначальнаяСтоимость                     = Выборка.ВосстановительнаяСтоимость;
			СтрокаИнвентарнойКниги.НачисленнаяАмортизацияИлиИзнос              = ?(Выборка.СчетНачисленияАмортизации <> ПланыСчетов.Хозрасчетный.ИзносОсновныхСредств, ?(Выборка.НачисленнаяАмортизация <> NULL, Выборка.НачисленнаяАмортизация, 0) + ?(Выборка.АмортизацияПоДокументу <> NULL, Выборка.АмортизацияПоДокументу, 0), ?(Выборка.НачисленныйИзнос <> NULL, Выборка.НачисленныйИзнос, 0) + ?(Выборка.ИзносПоДокументу <> NULL, Выборка.ИзносПоДокументу, 0));
			
			// Нечетная страница.
			СтрокаИнвентарнойКниги.ОстаточнаяСтоимость                         = ?(Выборка.ВосстановительнаяСтоимость <> NULL, Выборка.ВосстановительнаяСтоимость, 0) - СтрокаИнвентарнойКниги.НачисленнаяАмортизацияИлиИзнос;
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПредставлениеДокумента = Выборка.ПредставлениеДокумента;			
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПодразделение          = Выборка.ПредпоследнееМестонахождениеПредставление;
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеМОЛ                    = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.ПредпоследнееМОЛПредставление);
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПричинаВыбытия         = "";
			
		Иначе                                                         
			
			// Четная страница.
			СтрокаИнвентарнойКниги.ПоступилоПредставлениеДокумента             = "";
			СтрокаИнвентарнойКниги.ПоступилоДатаПринятияКУчету                 = "";
			СтрокаИнвентарнойКниги.ПоступилоДокументПринятияКУчету             = Неопределено;
			СтрокаИнвентарнойКниги.ПоступилоПодразделение                      = "";
			СтрокаИнвентарнойКниги.ПоступилоМОЛ                                = "";
			СтрокаИнвентарнойКниги.ПервоначальнаяСтоимость                     = Выборка.ВосстановительнаяСтоимость;
			СтрокаИнвентарнойКниги.НачисленнаяАмортизацияИлиИзнос              = ?(Выборка.СчетНачисленияАмортизации <> ПланыСчетов.Хозрасчетный.ИзносОсновныхСредств, ?(Выборка.НачисленнаяАмортизация <> NULL, Выборка.НачисленнаяАмортизация, 0) + ?(Выборка.АмортизацияПоДокументу <> NULL, Выборка.АмортизацияПоДокументу, 0), ?(Выборка.НачисленныйИзнос <> NULL, Выборка.НачисленныйИзнос, 0) + ?(Выборка.ИзносПоДокументу <> NULL, Выборка.ИзносПоДокументу, 0));
			
			// Нечетная страница.
			СтрокаИнвентарнойКниги.ОстаточнаяСтоимость                         = ?(Выборка.ВосстановительнаяСтоимость <> NULL, Выборка.ВосстановительнаяСтоимость, 0) - СтрокаИнвентарнойКниги.НачисленнаяАмортизацияИлиИзнос;
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПредставлениеДокумента = Выборка.ПредставлениеДокумента;			
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПодразделение          = Выборка.ПоследнееМестонахождениеПредставление;
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеМОЛ                    = ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.ПоследнееМОЛПредставление);
			СтрокаИнвентарнойКниги.ПеремещениеИлиВыбытиеПричинаВыбытия         = Выборка.ПричинаСписания;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Вывод страниц инвентарной книги.
	                    
	ДокументРезультат.Очистить();
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ПолеСверху         = 20;
	ДокументРезультат.ПолеСнизу          = 20;
	ДокументРезультат.ПолеСлева          = 10;
	ДокументРезультат.ПолеСправа         = 10;
	ДокументРезультат.ФиксацияСлева      = 3;
	
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентарнаяКнигаОС_Обложка";
	
	Макет = ПолучитьМакет("Страницы");
	// 37490 <<
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	// 37490 >>
	
	НомерЧетнойСтраницы   = 2;
	НомерНечетнойСтраницы = НомерЧетнойСтраницы + 1;
	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.НомерЧетнойСтраницы   = НомерЧетнойСтраницы;
	Шапка.Параметры.НомерНечетнойСтраницы = НомерНечетнойСтраницы;	
	ДокументРезультат.Вывести(Шапка);
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Для Каждого СтрокаИнвентарнойКниги Из СтрокиИнвентарнойКниги Цикл
		
		Строка = Макет.ПолучитьОбласть("Строка");
				
		Строка.Параметры.Заполнить(СтрокаИнвентарнойКниги);
		Строка.Параметры.НомерСтроки = СтрокиИнвентарнойКниги.Индекс(СтрокаИнвентарнойКниги) + 1;
		
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(Строка);
		СтрокаСПодвалом.Добавить(Подвал);

		Если НЕ ДокументРезультат.ПроверитьВывод(СтрокаСПодвалом) Тогда
			
			ДокументРезультат.Вывести(Подвал);
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();

			НомерЧетнойСтраницы   = НомерЧетнойСтраницы + 2;
			НомерНечетнойСтраницы = НомерНечетнойСтраницы + 2;
			
			Шапка = Макет.ПолучитьОбласть("Шапка");
			Шапка.Параметры.НомерЧетнойСтраницы   = НомерЧетнойСтраницы;
			Шапка.Параметры.НомерНечетнойСтраницы = НомерНечетнойСтраницы;
			ДокументРезультат.Вывести(Шапка);
			
		КонецЕсли;

		ДокументРезультат.Вывести(Строка);
		
	КонецЦикла;

	ДокументРезультат.Вывести(Подвал);
	
	ДокументРезультат.ТолькоПросмотр = Истина;
	
КонецПроцедуры // СформироватьСтраницы()

#КонецЕсли
